veryaner/esp8266-multi-sensor/src/web/webserver.cpp
#include <Arduino.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include <EEPROM.h>
#include <WiFiManager.h>
#include <PubSubClient.h>
#include "config.h"
#include "comm/wifi_manager.h"
#include "web/webserver.h"
#include "comm/mqtt.h"
#include "model/data_structs.h"
#include "debug/debug_macros.h"
#include "sensors/sensor_manager.h"
#include "model/config_manager.h"
#include "actuators/relay.h"
#include "comm/ota.h"


ESP8266WebServer server;

void setupWebServer()
{
    WEB_DEBUG_PRINTLN("Setting up web server...");
    MEMORY_DEBUG_PRINTF("Free heap before web server setup: %d bytes\n", ESP.getFreeHeap());

    // Check if LittleFS is available
    if (LittleFS.begin())
    {
        WEB_DEBUG_PRINTLN("LittleFS available - setting up static file serving");
        // Serve static files from LittleFS, but don't override API endpoints
        server.serveStatic("/static", LittleFS, "/", "max-age=86400");
        server.onNotFound([]()
                          {
            WEB_DEBUG_PRINTF("404 Not Found: %s\n", server.uri().c_str());
            // Only serve static files for /static/ paths
            if (server.uri().startsWith("/static/") && LittleFS.exists(server.uri().substring(8))) {
                server.serveStatic(server.uri().c_str(), LittleFS, server.uri().substring(8).c_str());
            } else {
                server.send(404, "text/plain", "Not Found");
            } });
    }
    else
    {
        WEB_DEBUG_PRINTLN("LittleFS not available - setting up basic API endpoints only");
    }

    // Set up a basic response for the root path (works with or without LittleFS)
    server.on("/", HTTP_GET, []()
              {
        if (LittleFS.exists("/index.html")) {
            File file = LittleFS.open("/index.html", "r");
            server.streamFile(file, "text/html");
            file.close();
        } else {
            server.send(404, "text/plain", "index.html not found");
        } });

    // API endpoints
    server.on("/api/sensors", HTTP_GET, []()
              {
        WEB_DEBUG_PRINTLN("=== API /api/sensors requested ===");
        MEMORY_DEBUG_PRINTF("Free heap before API call: %d bytes\n", ESP.getFreeHeap());
        WEB_DEBUG_PRINTLN("Starting sensor data collection...");
        
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        readAllSensors(); // Get fresh data
        
        // Create a simpler JSON structure first
        DynamicJsonDocument doc(512);
        
        // Basic sensor data
        doc["temperature"] = sensorData.temperature;
        doc["humidity"] = sensorData.humidity;
        doc["motion"] = sensorData.presence;
        doc["luminescence"] = sensorData.lux;
        doc["timestamp"] = sensorData.timestamp;
        doc["uptime"] = millis();
        doc["wifi_rssi"] = WiFi.RSSI();
        doc["free_heap"] = ESP.getFreeHeap();
        doc["sensorless_mode"] = config.sensorless_mode;
        doc["firmware_version"] = FIRMWARE_VERSION;
        
        String actualMotionSource = "none";
        if (config.use_ld2410 && sensorData.radar_available) {
            actualMotionSource = "radar";
        }
        else if (config.use_pir && sensorData.pir_available)
        {
            actualMotionSource = "pir";
        }
        doc["motion_source"] = actualMotionSource;
        doc["motion"] = (actualMotionSource == "radar") ? sensorData.radar_presence : sensorData.presence;
        
        // Simple sensor status (avoid nested objects for now)
        doc["dht11_available"] = sensorData.dht_available;
        doc["dht11_errors"] = sensorData.dht_error_count;
        doc["tsl2561_available"] = sensorData.tsl_available;
        doc["tsl2561_errors"] = sensorData.tsl_error_count;
        doc["pir_available"] = sensorData.pir_available;
        doc["pir_errors"] = sensorData.pir_error_count;
        doc["radar_presence"] = sensorData.radar_presence;
        doc["relay_state"] = getRelayState();
        doc["relay_pin"] = getRelayPin();

        String response;
        serializeJson(doc, response);
        
        WEB_DEBUG_PRINTF("API response length: %d bytes\n", response.length());
        WEB_DEBUG_PRINTF("API response: %s\n", response.c_str());
        MEMORY_DEBUG_PRINTF("Free heap after API call: %d bytes\n", ESP.getFreeHeap());
        
        server.send(200, "application/json", response); });

    server.on("/api/restart", HTTP_POST, []()
              {
        server.send(200, "text/plain", "Restarting...");
        delay(1000);
        ESP.restart(); });

    server.on("/api/wifi/reset", HTTP_POST, []()
              {
        server.send(200, "text/plain", "Resetting WiFi settings...");
        wifiManager.resetSettings();
        ESP.restart(); });

    server.on("/api/factory-reset", HTTP_POST, []()
              {
        server.send(200, "text/plain", "Performing factory reset...");
        // Clear EEPROM
        for (int i = 0; i < 512; i++) {
            EEPROM.write(i, 0);
        }
        EEPROM.commit();
        wifiManager.resetSettings();
        ESP.restart(); });

    server.on("/api/config", HTTP_GET, []()
              {
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        DynamicJsonDocument doc(512);
        doc["mqtt_broker"] = config.mqtt_broker;
        doc["mqtt_port"] = config.mqtt_port;
        doc["mqtt_username"] = config.mqtt_username;
        doc["location"] = config.location;
        doc["mqtt_enabled"] = config.mqtt_enabled;
        doc["sensorless_mode"] = config.sensorless_mode;

        
        // Add sensor enable flags
        doc["use_dht"] = config.use_dht;
        doc["use_tsl2561"] = config.use_tsl2561;
        doc["use_pir"] = config.use_pir;
        doc["use_ld2410"] = config.use_ld2410;
        doc["use_relay"] = config.use_relay;
        
        String response;
        serializeJson(doc, response);
        
