veryaner/esp8266-multi-sensor/src/web/webserver.cpp
        // Timing configuration
        doc["timing"]["sensor_read_interval"] = SENSOR_READ_INTERVAL;
        doc["timing"]["mqtt_publish_interval"] = MQTT_PUBLISH_INTERVAL;
        doc["timing"]["pir_cooldown"] = PIR_COOLDOWN;
        doc["timing"]["ota_check_interval"] = OTA_CHECK_INTERVAL;
        
        // MQTT topics
        doc["mqtt_topics"]["temperature"] = MQTT_TOPIC_TEMPERATURE;
        doc["mqtt_topics"]["humidity"] = MQTT_TOPIC_HUMIDITY;
        doc["mqtt_topics"]["motion"] = MQTT_TOPIC_MOTION;
        doc["mqtt_topics"]["luminescence"] = MQTT_TOPIC_LUMINESCENCE;
        doc["mqtt_topics"]["status"] = MQTT_TOPIC_STATUS;
        doc["mqtt_topics"]["all"] = MQTT_TOPIC_ALL;
        
        // Export timestamp
        doc["export_timestamp"] = millis();
        doc["export_uptime"] = millis();
        
        String response;
        serializeJsonPretty(doc, response);
        
        server.sendHeader("Content-Disposition", "attachment; filename=esp8266_config.json");
        server.send(200, "application/json", response); });

    // Print full configuration to serial monitor
    server.on("/api/config/print", HTTP_POST, []()
              {
        DEBUG_PRINTLN("Full configuration requested via API...");
        printFullConfig();
        
        DynamicJsonDocument responseDoc(128);
        responseDoc["message"] = "Configuration printed to serial monitor";
        responseDoc["timestamp"] = millis();
        
        String response;
        serializeJson(responseDoc, response);
        server.send(200, "application/json", response); });

    server.on("/api/sensorless", HTTP_POST, []()
              {
        String body = server.arg("plain");
        DynamicJsonDocument doc(256);
        deserializeJson(doc, body);
        
        if (doc.containsKey("enabled"))
        {
            config.sensorless_mode = doc["enabled"];
            saveConfig();
            
            DynamicJsonDocument responseDoc(128);
            responseDoc["sensorless_mode"] = config.sensorless_mode;
            responseDoc["message"] = config.sensorless_mode ? "Sensorless mode enabled" : "Sensorless mode disabled";
            
            String response;
            serializeJson(responseDoc, response);
            server.send(200, "application/json", response);
        }
        else
        {
            server.send(400, "application/json", "{\"error\": \"Missing 'enabled' parameter\"}");
        } });

    // Simple test endpoint
    server.on("/test", HTTP_GET, []()
              {
        WEB_DEBUG_PRINTLN("Test endpoint requested");
        MEMORY_DEBUG_PRINTF("Free heap: %d bytes\n", ESP.getFreeHeap());
        server.send(200, "text/plain", "ESP8266 is working! Free heap: " + String(ESP.getFreeHeap()) + " bytes"); });

    // Very simple API test endpoint
    server.on("/api/test", HTTP_GET, []()
              {
        WEB_DEBUG_PRINTLN("API test endpoint requested");
        server.send(200, "application/json", "{\"status\":\"ok\",\"message\":\"API is working\"}"); });

    // Ultra simple test endpoint
    server.on("/simple", HTTP_GET, []()
              {
        WEB_DEBUG_PRINTLN("Simple endpoint requested");
        server.send(200, "text/plain", "Simple endpoint works!"); });

    // Health check endpoint
    server.on("/health", HTTP_GET, []()
              {
        WEB_DEBUG_PRINTLN("Health check requested");
        DynamicJsonDocument doc(256);
        doc["status"] = "ok";
        doc["uptime"] = millis();
        doc["free_heap"] = ESP.getFreeHeap();
        doc["wifi_rssi"] = WiFi.RSSI();
        doc["ip"] = WiFi.localIP().toString();
        
        String response;
        serializeJson(doc, response);
        server.send(200, "application/json", response); });

    // Debug endpoint for sensor data
    server.on("/debug/sensors", HTTP_GET, []()
              {
        WEB_DEBUG_PRINTLN("Debug sensors endpoint requested");
        
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        // Create a simple response first
        DynamicJsonDocument doc(256);
        doc["test"] = "sensor_data";
        doc["free_heap"] = ESP.getFreeHeap();
        doc["uptime"] = millis();
        
        // Add sensor data step by step
        doc["temperature"] = sensorData.temperature;
        doc["humidity"] = sensorData.humidity;
        doc["motion"] = sensorData.presence;
        doc["luminescence"] = sensorData.lux;
        doc["timestamp"] = sensorData.timestamp;
        doc["radar_presence"] = sensorData.radar_presence;
        
        // Add sensor status
        doc["dht_available"] = sensorData.dht_available;
        doc["tsl_available"] = sensorData.tsl_available;
        doc["pir_available"] = sensorData.pir_available;
        doc["radar_available"] = sensorData.radar_available;
        
        String response;
        serializeJson(doc, response);
        
        WEB_DEBUG_PRINTF("Debug response length: %d bytes\n", response.length());
        WEB_DEBUG_PRINTF("Debug response: %s\n", response.c_str());
        
        server.send(200, "application/json", response); });

    // Reset sensor status endpoint
    server.on("/api/sensors/reset", HTTP_POST, []()
              {
        WEB_DEBUG_PRINTLN("Resetting sensor status...");
        
        // Reset all error counters
        sensorData.dht_error_count = 0;
        sensorData.tsl_error_count = 0;
        sensorData.pir_error_count = 0;
        
        // Mark all sensors as available for retry
        sensorData.dht_available = true;
        sensorData.tsl_available = true;
        sensorData.pir_available = true;
        sensorData.radar_available = true;
        
        config.sensorless_mode = false;
        saveConfig();
        
        DynamicJsonDocument responseDoc(256);
        responseDoc["message"] = "Sensor status reset - all sensors marked as available";
        responseDoc["sensorless_mode"] = false;
        responseDoc["sensors"]["dht11"]["available"] = true;
        responseDoc["sensors"]["dht11"]["error_count"] = 0;
        responseDoc["sensors"]["tsl2561"]["available"] = true;
        responseDoc["sensors"]["tsl2561"]["error_count"] = 0;
        responseDoc["sensors"]["pir"]["available"] = true;
        responseDoc["sensors"]["pir"]["error_count"] = 0;
        responseDoc["sensors"]["radar"]["available"] = true;
        responseDoc["sensors"]["radar"]["error_count"] = 0;
        
        String response;
        serializeJson(responseDoc, response);
        server.send(200, "application/json", response); });

    // Individual sensor reset endpoints
    server.on("/api/sensors/dht11/reset", HTTP_POST, []()
              {
        WEB_DEBUG_PRINTLN("Resetting DHT11 sensor status...");
        sensorData.dht_error_count = 0;
        sensorData.dht_available = true;
        
        DynamicJsonDocument responseDoc(128);
        responseDoc["message"] = "DHT11 sensor reset";
        responseDoc["sensors"]["dht11"]["available"] = true;
        responseDoc["sensors"]["dht11"]["error_count"] = 0;
        
        String response;
        serializeJson(responseDoc, response);
        server.send(200, "application/json", response); });

    server.on("/api/sensors/tsl2561/reset", HTTP_POST, []()
              {
        WEB_DEBUG_PRINTLN("Resetting TSL2561 sensor status...");
        sensorData.tsl_error_count = 0;
        sensorData.tsl_available = true;
        
        DynamicJsonDocument responseDoc(128);
        responseDoc["message"] = "TSL2561 sensor reset";
        responseDoc["sensors"]["tsl2561"]["available"] = true;
        responseDoc["sensors"]["tsl2561"]["error_count"] = 0;
        
        String response;
        serializeJson(responseDoc, response);
        server.send(200, "application/json", response); });

    server.on("/api/sensors/pir/reset", HTTP_POST, []()
              {
        WEB_DEBUG_PRINTLN("Resetting PIR sensor status...");
        sensorData.pir_error_count = 0;
        sensorData.pir_available = true;
        
        DynamicJsonDocument responseDoc(128);
        responseDoc["message"] = "PIR sensor reset";
        responseDoc["sensors"]["pir"]["available"] = true;
        responseDoc["sensors"]["pir"]["error_count"] = 0;
        
        String response;
        serializeJson(responseDoc, response);
        server.send(200, "application/json", response); });

    // Handle CORS preflight requests
    server.on("/api/sensors", HTTP_OPTIONS, []()
              {
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        server.send(200, "text/plain", ""); });

    // Debug mode toggle endpoint
    server.on("/api/debug", HTTP_POST, []()
              {
        String body = server.arg("plain");
        DynamicJsonDocument doc(256);
        deserializeJson(doc, body);
        
        if (doc.containsKey("enabled"))
        {
            bool debugEnabled = doc["enabled"];
            // Note: This would require recompiling to take effect
            // For now, just return the current status
            
            DynamicJsonDocument responseDoc(128);
            responseDoc["debug_mode"] = debugEnabled;
            responseDoc["message"] = debugEnabled ? "Debug mode enabled (requires restart)" : "Debug mode disabled (requires restart)";
            responseDoc["note"] = "Debug mode changes require firmware recompilation";
            
            String response;
            serializeJson(responseDoc, response);
            server.send(200, "application/json", response);
        }
        else
        {
            server.send(400, "application/json", "{\"error\": \"Missing 'enabled' parameter\"}");
        } });

    // Sensor configuration endpoint for frontend
    server.on("/api/sensor-config", HTTP_GET, []()
              {
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        DynamicJsonDocument doc(256);
        doc["use_dht"] = config.use_dht;
        doc["use_tsl2561"] = config.use_tsl2561;
        doc["use_pir"] = config.use_pir;
        doc["use_ld2410"] = config.use_ld2410;
        doc["use_relay"] = config.use_relay;
        
        String response;
        serializeJson(doc, response);
        
