veryaner/esp8266-multi-sensor/src/web/webserver.cpp
        server.send(200, "application/json", response); });

    // Relay API endpoints
    server.on("/api/relay", HTTP_GET, []()
              {
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        DynamicJsonDocument doc(128);
        doc["state"] = getRelayState();
        doc["pin"] = getRelayPin();
        
        String response;
        serializeJson(doc, response);
        
        server.send(200, "application/json", response); });

    server.on("/api/relay", HTTP_POST, []()
              {
        // Add CORS headers
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
        
        String body = server.arg("plain");
        DynamicJsonDocument doc(128);
        deserializeJson(doc, body);
        
        bool newState = false;
        
        if (doc.containsKey("state")) {
            newState = doc["state"];
            setRelayState(newState);
        } else {
            // Toggle if no state specified
            newState = !getRelayState();
            setRelayState(newState);
        }
        
        DynamicJsonDocument responseDoc(128);
        responseDoc["state"] = newState;
        responseDoc["pin"] = getRelayPin();
        responseDoc["message"] = newState ? "Relay turned ON" : "Relay turned OFF";
        
        String response;
        serializeJson(responseDoc, response);
        
        server.send(200, "application/json", response); });

    // Register HTTP OTA endpoint (/update)
    setupOTA_HTTP(server);

    // LittleFS upload form (GET)
    server.on("/uploadfs", HTTP_GET, []()
              { server.send(200, "text/html", "<form method='POST' action='/uploadfs' enctype='multipart/form-data'><input type='file' name='fs'><input type='submit' value='Upload FS'></form>"); });
    // LittleFS upload handler (POST)
    server.on("/uploadfs", HTTP_POST, []()
              {
        server.send(200, "text/plain", Update.hasError() ? "FS Update Failed" : "FS Update Success. Rebooting...");
        delay(1000);
        ESP.restart(); }, []()
              {
        HTTPUpload& upload = server.upload();
        static size_t fsBytes = 0;
        if (upload.status == UPLOAD_FILE_START) {
            fsBytes = 0;
            if (!Update.begin((size_t)upload.totalSize, U_FS)) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_WRITE) {
            if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                Update.printError(Serial);
            }
            fsBytes += upload.currentSize;
        } else if (upload.status == UPLOAD_FILE_END) {
            if (Update.end(true)) {
                Serial.printf("FS Update Success: %u bytes\n", fsBytes);
            } else {
                Update.printError(Serial);
            }
        } });

    server.begin();
    WEB_DEBUG_PRINTLN("Web server started");
    MEMORY_DEBUG_PRINTF("Free heap after web server setup: %d bytes\n", ESP.getFreeHeap());

    // Debug: List all registered endpoints
    WEB_DEBUG_PRINTLN("Registered endpoints:");
    WEB_DEBUG_PRINTLN("- GET /");
    WEB_DEBUG_PRINTLN("- GET /api/sensors");
    WEB_DEBUG_PRINTLN("- GET /api/config");
    WEB_DEBUG_PRINTLN("- GET /health");
    WEB_DEBUG_PRINTLN("- GET /test");
    WEB_DEBUG_PRINTLN("- GET /simple");
    WEB_DEBUG_PRINTLN("- POST /api/restart");
    WEB_DEBUG_PRINTLN("- POST /api/wifi/reset");
    WEB_DEBUG_PRINTLN("- POST /api/sensors/reset");
}